{
  "backend/main.mo": "Defines core backend actor with authorization, storage, Stripe integration, and data types for users, listings, bookings, and related domain models.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no recorded features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend source files used as reference descriptions.",
  "frontend/index.css": "Tailwind base and theme variable definitions including light/dark color tokens and global styling rules.",
  "frontend/index.html": "HTML entry file defining meta tags, SEO data, and root app container for the frontend.",
  "frontend/src/App.tsx": "Sets up React Router routes, QueryClient, theme provider, and mounts all application pages.",
  "frontend/src/components/AvailabilityCounter.tsx": "Displays animated real‑time availability counts for four property types with loading skeleton and styled cards.",
  "frontend/src/components/AvailabilityModal.tsx": "Empty or placeholder file with no content provided.",
  "frontend/src/components/BookingSteps.tsx": "Renders a three-step booking flow UI with animated icons and styling based on listing category.",
  "frontend/src/components/CategoryGrid.tsx": "Empty file with no content provided.",
  "frontend/src/components/ExploreSection.tsx": "Empty file with no content provided.",
  "frontend/src/components/FeaturedListings.tsx": "Fetches featured listings and displays them in a grid with loading skeletons and styled variants.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with branding, navigation links, social icons, and copyright text.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with authentication handling, routing buttons, and admin/user options.",
  "frontend/src/components/HeroSection.tsx": "Empty file with no content provided.",
  "frontend/src/components/IndiaMapSection.tsx": "Shows an interactive India map with animated city markers indicating active and upcoming locations.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with header, footer, routed content, and optional profile setup modal.",
  "frontend/src/components/ListingCard.tsx": "Displays a property card with category icons, rating, availability, and styled variants linking to details.",
  "frontend/src/components/ListingCard3D.tsx": "3D-styled listing card showing image, category icon, availability, rating, and navigation behavior.",
  "frontend/src/components/ListingDetailModal.tsx": "Empty placeholder file for a listing detail modal component.",
  "frontend/src/components/MapSection.tsx": "Map section displaying animated markers, floating badges, and property info using event marker data.",
  "frontend/src/components/ProfileSetupModal.tsx": "Profile setup dialog allowing users to submit name, email, phone, and owner status, then saving via mutation.",
  "frontend/src/components/PropertyStatusBadge.tsx": "Badge component mapping property status to label, icon, and styling.",
  "frontend/src/components/ReviewSection.tsx": "Review display and submission UI with rating, comment form, and review list for a listing.",
  "frontend/src/components/StarRating.tsx": "Reusable interactive star rating component supporting custom sizes and click handling.",
  "frontend/src/components/TestimonialBubbles.tsx": "Empty placeholder component file for testimonial bubbles.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch and mutate backend data such as user profiles, listings, reviews, events, and admin operations via an actor interface.",
  "frontend/src/index.css": "Global stylesheet configuring Tailwind layers, custom OKLCH-based theme variables, fonts, and animation keyframes for the UI.",
  "frontend/src/main.tsx": "Entrypoint that initializes React, sets up QueryClient, and wraps the app with InternetIdentityProvider.",
  "frontend/src/pages/AboutUsPage.tsx": "Renders the About Us page with styled sections describing STYO, its registration details, and leadership team.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard with identity checks, data fetching hooks, notification handling, quick publish, and UI for managing users, listings, and city charges.",
  "frontend/src/pages/BookingPolicyPage.tsx": "Renders a styled booking policy page with scrollable sections outlining terms, cancellation rules, and payment details.",
  "frontend/src/pages/CategoryWorldPage.tsx": "Displays a grid of accommodation categories with images and animations, allowing navigation to filtered listings.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring animated category cards, lazy‑loaded sections, and navigation to listings and other site features.",
  "frontend/src/pages/ListingPage.tsx": "Lists accommodations with category filtering, lazy‑loaded cards and map, and synced URL search parameters.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits the user profile with identity checks, form fields, save logic, and logout handling.",
  "frontend/src/pages/PropertyManagementPage.tsx": "Page for owners to create, edit, and manage their property listings with form handling, dialogs, and backend mutations.",
  "frontend/src/pages/PublicPropertySubmissionPage.tsx": "Public-facing form allowing anyone to submit a property listing with validation, image uploads, and backend submission.",
  "frontend/src/pages/UnlockPage.tsx": "Displays locked property details and handles unlocking owner contact info, including download, call, and WhatsApp actions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, shadows, plugins, and content scanning paths.",
  "project_state.json": "Defines project state for adding a new PropertyStatus enum and integrating it into backend listings and frontend UI. Includes existing features, new feature requests, and architectural notes guiding the status model and display updates."
}