{
  "backend/main.mo": "Defines the backend actor with authorization, storage, Stripe mixins, and data models for users, listings, bookings, and related domain types.",
  "feature_evidence.json": "Feature evidence report mapping header‑logo‑related feature requirements to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, pages, and configuration files for build reference.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables, dark mode tokens, and global background/foreground styling.",
  "frontend/index.html": "Main HTML entry file with meta tags, SEO settings, icons, and root div for mounting the frontend app.",
  "frontend/src/App.tsx": "Sets up the app router, theme provider, query client, and all application routes including policy pages and property submission.",
  "frontend/src/components/AvailabilityCounter.tsx": "Displays live availability counts for property categories with loading skeletons and animated UI cards.",
  "frontend/src/components/AvailabilityModal.tsx": "Empty file placeholder for an availability modal component.",
  "frontend/src/components/BookingSteps.tsx": "Renders a three-step booking guide with icons and category-based visuals.",
  "frontend/src/components/CategoryGrid.tsx": "Empty file placeholder for a category grid component.",
  "frontend/src/components/ExploreSection.tsx": "Empty file placeholder for an explore section component.",
  "frontend/src/components/FeaturedListings.tsx": "Fetches and displays featured listings with skeletons and variant-based listing cards.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, links, social icons, and contact info.",
  "frontend/src/components/Header.tsx": "Implements a navigation header with auth handling, user/admin checks, and route navigation.",
  "frontend/src/components/HeroSection.tsx": "Empty file placeholder for a hero section component.",
  "frontend/src/components/IndiaMapSection.tsx": "Displays an India map with animated city markers showing active and coming-soon locations.",
  "frontend/src/components/Layout.tsx": "Defines the app layout with header, footer, routed content, and conditional profile-setup modal.",
  "frontend/src/components/ListingCard.tsx": "A customizable listing card component showing images, ratings, availability, category icons, and navigation to details.",
  "frontend/src/components/ListingCard3D.tsx": "A 3D‑styled animated listing card displaying images, ratings, availability, and category icons with hover effects.",
  "frontend/src/components/ListingDetailModal.tsx": "Empty placeholder file for a listing detail modal.",
  "frontend/src/components/MapSection.tsx": "Displays an animated map section with event markers, bouncing pins, and floating info badges.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal for creating a user profile with fields for name, email, phone, and owner status, saving via API.",
  "frontend/src/components/PropertyStatusBadge.tsx": "Renders a status badge for property availability with icons and styling based on status.",
  "frontend/src/components/ReviewSection.tsx": "Shows listing reviews, allows logged‑in users to submit new reviews with rating and text.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating component supporting interactive selection and partial fill display.",
  "frontend/src/components/TestimonialBubbles.tsx": "Empty placeholder file for testimonial bubbles.",
  "frontend/src/components/TrustBadge.tsx": "React memoized badge component rendering gradient-styled labels with optional icon based on variant and size.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth state, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping actor calls for user profiles, listings, reviews, and related backend data.",
  "frontend/src/index.css": "Global Tailwind-based styles defining fonts, color variables, animations, and base theming.",
  "frontend/src/main.tsx": "App bootstrap file setting up QueryClient and InternetIdentityProvider before rendering the root component.",
  "frontend/src/pages/AboutUsPage.tsx": "Styled About Us page describing STYO with sections for company registration and leadership details.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page handling user, listing, notifications, and city charge data with actions like quick publish and free‑trial mode toggles.",
  "frontend/src/pages/BookingPolicyPage.tsx": "Static booking policy page rendering terms, disclaimers, and sections with styled UI elements.",
  "frontend/src/pages/CategoryWorldPage.tsx": "Displays a grid of accommodation categories that navigate to filtered listings when clicked.",
  "frontend/src/pages/HomePage.tsx": "Home page showcasing category and stay‑type cards, maps, and availability counters using lazy‑loaded components.",
  "frontend/src/pages/ListingPage.tsx": "Listing browser with category filtering, dynamic routing, and lazy‑loaded map and 3D listing cards.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a styled privacy policy page with scrollable sections describing data use and user privacy commitments.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits user profile data with save and logout actions, using hooks for identity and backend sync.",
  "frontend/src/pages/PropertyManagementPage.tsx": "Provides interfaces to create, edit, and manage property listings tied to the logged‑in owner.",
  "frontend/src/pages/PublicPropertySubmissionPage.tsx": "Public form for submitting property listings with validation, image uploads, and backend submission.",
  "frontend/src/pages/RefundPolicyPage.tsx": "Renders a styled refund policy page detailing conditions for the ₹99 unlock‑fee refund.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Renders a styled Terms & Conditions page with scrollable sections, headers, and disclaimer content.",
  "frontend/src/pages/UnlockPage.tsx": "Displays a property unlock flow allowing users to view contact details after authentication and triggering backend unlock requests.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL parameters using query strings, hash fragments, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including colors, shadows, animations, and content paths.",
  "project_state.json": "Describes current project state, known issues, and feature requirements for updating the navbar logo sizing and alignment."
}