{
  "backend/main.mo": "Main canister actor defining user profiles, listings, bookings, and mixin integrations for storage, authorization, and Stripe payments.",
  "backend/migration.mo": "Migration module converting old listing structures to new ones by adding a status timestamp across all stored maps.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes.",
  "frontend/index.html": "HTML entry document with SEO metadata and root mount point for the frontend app.",
  "frontend/src/App.tsx": "App entry configuring TanStack Router routes, React Query client, and theme provider.",
  "frontend/src/components/AvailabilityCounter.tsx": "Displays live availability counts for various property types with loading skeletons and animated cards.",
  "frontend/src/components/AvailabilityModal.tsx": "Empty file with no implementation.",
  "frontend/src/components/BookingSteps.tsx": "Renders a three‑step visual guide for booking properties, with icons and category‑based styling.",
  "frontend/src/components/CategoryGrid.tsx": "Empty file with no implementation.",
  "frontend/src/components/ExploreSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/FeaturedListings.tsx": "Fetches and displays featured listings using ListingCard components, with skeletons for loading states.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, social icons, and copyright.",
  "frontend/src/components/Header.tsx": "Implements the main header with navigation, authentication handling, and admin/user‑specific options.",
  "frontend/src/components/HeroSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/IndiaMapSection.tsx": "Displays an interactive India map with animated city markers showing active and coming‑soon locations.",
  "frontend/src/components/Layout.tsx": "Wraps the page with header, footer, routed content, and conditionally shows a profile setup modal.",
  "frontend/src/components/ListingCard.tsx": "Renders a stylized listing card with availability, rating, category icons, and click-to-view navigation logic.",
  "frontend/src/components/ListingCard3D.tsx": "Displays a 3D-animated listing card showing images, ratings, availability, and category icons.",
  "frontend/src/components/ListingDetailModal.tsx": "Empty file placeholder for a listing detail modal component.",
  "frontend/src/components/MapSection.tsx": "Shows an animated map-like section with bouncing markers and floating info badges using event marker data.",
  "frontend/src/components/ProfileSetupModal.tsx": "Provides a modal for creating a user profile with form inputs and backend submission.",
  "frontend/src/components/PropertyStatusBadge.tsx": "Renders a badge indicating a property's status with specific icons and styling per status type.",
  "frontend/src/components/ReviewSection.tsx": "Handles displaying reviews and submitting new ones with rating selection and authenticated user checks.",
  "frontend/src/components/StarRating.tsx": "A star-based rating component supporting interactive selection and variable sizes.",
  "frontend/src/components/TestimonialBubbles.tsx": "Empty file placeholder for a testimonial bubbles component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as profiles, listings, reviews, events, and admin actions using the actor.",
  "frontend/src/index.css": "Global CSS file configuring Tailwind, color variables, fonts, and custom animations for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AboutUsPage.tsx": "Renders the STYO About Us page with sections for company registration and leadership details.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard page, loading admin data, handling quick publish, city charges, notifications, and access control.",
  "frontend/src/pages/BookingPolicyPage.tsx": "Renders a styled booking policy page with scrollable sections detailing platform terms and disclaimers.",
  "frontend/src/pages/CategoryWorldPage.tsx": "Displays a grid of category cards that navigate to filtered listings when clicked.",
  "frontend/src/pages/HomePage.tsx": "Home screen featuring animated category cards, lazy‑loaded sections, and navigation to listings.",
  "frontend/src/pages/ListingPage.tsx": "Shows property listings with category filtering, loading states, and lazy‑loaded 3D cards and map.",
  "frontend/src/pages/ProfilePage.tsx": "Provides user profile viewing and editing with save and logout actions, using identity and query hooks.",
  "frontend/src/pages/PropertyManagementPage.tsx": "Provides UI for owners to create, edit, and update their property listings including availability, location, and status fields.",
  "frontend/src/pages/PublicPropertySubmissionPage.tsx": "Implements a public-facing form allowing non‑logged‑in users to submit property listings with validation and image uploads.",
  "frontend/src/pages/UnlockPage.tsx": "Displays property details and handles unlock requests so logged‑in users can access owner contact information and interact with the listing.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, shadows, animations, and container settings for the frontend.",
  "project_state.json": "Metadata describing the project’s current state and pending feature requests related to property status transition logic and timeouts."
}