{
  "backend/main.mo": "Defines the main canister actor with user profiles, listings, bookings, access control, Stripe integration, and storage mixins.",
  "feature_evidence.json": "Contains an empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Lists prewritten summaries of numerous frontend files including pages, components, hooks, and styles.",
  "frontend/index.css": "Tailwind CSS base setup with extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry file configuring meta tags, SEO properties, and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router, React Query, theming, and all route definitions for the frontend app.",
  "frontend/src/components/AvailabilityCounter.tsx": "Displays live availability counts for property categories with animated gradient cards and loading skeleton.",
  "frontend/src/components/AvailabilityModal.tsx": "File present but contains no implementation content.",
  "frontend/src/components/BookingSteps.tsx": "Displays a three‑step booking guide with category‑based icons and animated UI blocks.",
  "frontend/src/components/CategoryGrid.tsx": "File is empty or contains no content.",
  "frontend/src/components/ExploreSection.tsx": "File is empty or contains no content.",
  "frontend/src/components/FeaturedListings.tsx": "Fetches featured listings and renders them in a grid with loading skeletons and styled ListingCards.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, social icons, and copyright text.",
  "frontend/src/components/Header.tsx": "Implements the top navigation bar with login/logout logic, route navigation, and conditional admin/user options.",
  "frontend/src/components/HeroSection.tsx": "File is empty or contains no content.",
  "frontend/src/components/IndiaMapSection.tsx": "Shows an interactive India map with animated city markers indicating active and coming‑soon locations.",
  "frontend/src/components/Layout.tsx": "Wraps pages with header, footer, and conditionally shows a profile setup modal for authenticated users.",
  "frontend/src/components/ListingCard.tsx": "Displays a property card with rating, availability, category icon, and styled variants, linking to its detail page.",
  "frontend/src/components/ListingCard3D.tsx": "3D-styled listing card showing images, availability, rating, category icons, and navigation interaction.",
  "frontend/src/components/ListingDetailModal.tsx": "Empty file or placeholder for a listing detail modal component.",
  "frontend/src/components/MapSection.tsx": "Displays an animated map section with event markers, floating badges, and interactive pin tooltips.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and submitting user profile details with validation and backend mutation.",
  "frontend/src/components/PropertyStatusBadge.tsx": "Renders a badge reflecting a property's status with corresponding color, icon, and styling.",
  "frontend/src/components/ReviewSection.tsx": "Handles review display and submission, including rating input, form toggling, validation, and backend updates.",
  "frontend/src/components/StarRating.tsx": "Interactive or static star rating component supporting partial fill and size variants.",
  "frontend/src/components/TestimonialBubbles.tsx": "Empty file or placeholder for testimonial bubble UI component.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, listings, reviews, events, and admin-related resources through the actor API.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, typography, animations, and base UI theming for the application.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutUsPage.tsx": "Renders the About Us page with company information, registration details, and leadership profiles using styled UI components.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard, loading admin data, handling access control, managing listings, users, notifications, and settings with extensive UI controls.",
  "frontend/src/pages/BookingPolicyPage.tsx": "Renders a styled booking policy page with scrollable sections detailing platform policies and terms.",
  "frontend/src/pages/CategoryWorldPage.tsx": "Displays a grid of accommodation categories with images and navigates to filtered listings on selection.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring animated category cards, lazy‑loaded map and availability widgets, and navigation to listings.",
  "frontend/src/pages/ListingPage.tsx": "Shows listings with category filtering, lazy‑loaded listing cards and map, and syncs selected category with URL search params.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page enabling viewing and editing profile data, saving updates, and logging out via Internet Identity.",
  "frontend/src/pages/PropertyManagementPage.tsx": "Provides UI and logic for owners to create, edit, and manage their property listings using form dialogs and backend mutations.",
  "frontend/src/pages/PublicPropertySubmissionPage.tsx": "Implements a public form for submitting property listings with validation, image uploads, and backend submission.",
  "frontend/src/pages/UnlockPage.tsx": "Displays a property detail view requiring unlock actions to reveal contact info, including rating, reviews, and download options.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters and session-stored parameters, supporting hash and query formats.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, shadows, animations, and content paths for the project.",
  "project_state.json": "Tracks project state for adding a new PropertyStatus system, outlining related backend model changes, frontend badge updates, and pending feature requests. Contains architectural notes and existing/new feature definitions for implementing the 4‑status model without additional logic."
}