{
  "backend/main.mo": "Defines user profiles, listings, bookings, and related types with authorization, storage, and Stripe mixins for a backend actor.",
  "feature_evidence.json": "Lists feature evidence items with feature metadata, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptive summaries for various frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Sets global Tailwind CSS variables and themes for light and dark modes with base styling rules.",
  "frontend/index.html": "HTML entry point defining metadata, SEO tags, favicon paths, and root app mount point.",
  "frontend/src/App.tsx": "Main React app setup configuring routing, theming, and React Query providers for all pages.",
  "frontend/src/components/AvailabilityCounter.tsx": "Displays live availability counts for various property types with loading skeletons and animated UI cards.",
  "frontend/src/components/AvailabilityModal.tsx": "Empty file placeholder for an availability modal component.",
  "frontend/src/components/BookingSteps.tsx": "Renders a three‑step booking guide with icons and styled gradient cards based on listing category.",
  "frontend/src/components/CategoryGrid.tsx": "Empty file placeholder for a category grid component.",
  "frontend/src/components/ExploreSection.tsx": "Empty file placeholder for an explore section component.",
  "frontend/src/components/FeaturedListings.tsx": "Fetches and displays featured listings with loading skeletons and alternating card variants.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with logo, navigation links, legal links, and social icons.",
  "frontend/src/components/Header.tsx": "Implements the top navigation bar with routing, login/logout handling, and conditional admin/user actions.",
  "frontend/src/components/HeroSection.tsx": "Empty file placeholder for a hero section component.",
  "frontend/src/components/IndiaMapSection.tsx": "Shows an interactive India map with animated city markers indicating active and coming‑soon locations.",
  "frontend/src/components/Layout.tsx": "Wraps the page with header, footer, routed content, and conditionally shows a profile setup modal.",
  "frontend/src/components/ListingCard.tsx": "Renders a listing preview card with rating, availability, category icon, and dynamic styling variants. Handles navigation and computes display data via hooks.",
  "frontend/src/components/ListingCard3D.tsx": "Displays a 3D‑animated listing card with image, rating, availability, and category icon. Uses hover effects and query hooks for listing data.",
  "frontend/src/components/ListingDetailModal.tsx": "Empty placeholder file for a listing detail modal component.",
  "frontend/src/components/MapSection.tsx": "Renders a styled map-like section with animated pins and floating badges sourced from event marker queries.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving user profile data with form validation and API mutation.",
  "frontend/src/components/PropertyStatusBadge.tsx": "Shows a status badge for property availability with icon and styling based on status enum.",
  "frontend/src/components/ReviewSection.tsx": "Displays reviews for a listing and provides a form for authenticated users to submit new reviews.",
  "frontend/src/components/StarRating.tsx": "Interactive or static star rating component supporting different sizes and click-to-rate behavior.",
  "frontend/src/components/TestimonialBubbles.tsx": "Empty placeholder file for testimonial bubble UI.",
  "frontend/src/components/TrustBadge.tsx": "React component rendering a stylized trust badge with variants and gradients using SVG and dynamic sizing.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and tracks a backend actor based on Internet Identity, refreshing queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity login, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, listings, reviews, and related backend data via the actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup with OKLCH color variables, typography, dark mode, and custom animations.",
  "frontend/src/main.tsx": "App entry point that mounts React, wraps it with QueryClient and InternetIdentity providers, and loads global styles.",
  "frontend/src/pages/AboutUsPage.tsx": "Static About Us page describing the company, registration details, and leadership with styled UI elements.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard fetching admin data, managing submissions, notifications, charges, and quick-publish actions with access control.",
  "frontend/src/pages/BookingPolicyPage.tsx": "Static booking policy page displaying disclaimers and terms with styled sections and scrollable content.",
  "frontend/src/pages/CategoryWorldPage.tsx": "Category selection page showing accommodation categories and navigating to filtered listings on click.",
  "frontend/src/pages/HomePage.tsx": "Homepage rendering categories, stay types, lazy‑loaded map and counters, and navigation to listings.",
  "frontend/src/pages/ListingPage.tsx": "Listing browser with category filtering, fetching listings by category, and lazy‑loaded cards and map.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a styled privacy policy page with scrollable sections describing data practices and user privacy commitments.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the logged-in user's profile, handling form state, saving updates, and logout actions.",
  "frontend/src/pages/PropertyManagementPage.tsx": "Provides CRUD tools for owners to create, edit, and manage property listings tied to their identity.",
  "frontend/src/pages/PublicPropertySubmissionPage.tsx": "Allows the public to submit property listings with validation, image uploads, and form handling.",
  "frontend/src/pages/RefundPolicyPage.tsx": "Shows a styled refund policy page explaining conditions for refunds on the unlock fee.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Renders a styled Terms & Conditions page with scrollable sections, disclaimers, and visual UI elements using custom components.",
  "frontend/src/pages/UnlockPage.tsx": "Handles unlocking property contact details, fetching listing data, showing ratings, and providing call/WhatsApp/download actions.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters, including sessionStorage helpers and hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, shadows, animations, and container settings for the project’s design system.",
  "project_state.json": "Project state metadata describing branding asset requirements, known issues, and feature tasks related to STYO logo and favicon fixes."
}