{
  "backend/main.mo": "Defines core backend actor with access control, Stripe mixins, storage, user profiles, listings, bookings, and related types and modules.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files such as pages, components, hooks, and styling.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode values, and base styling.",
  "frontend/index.html": "Main HTML entry file with SEO metadata, social tags, favicon, and root mount point.",
  "frontend/src/App.tsx": "Application root configuring TanStack Router routes, theme provider, query client, and all main page components.",
  "frontend/src/components/AvailabilityCounter.tsx": "Displays live availability counts for multiple property types with loading skeletons and animated cards.",
  "frontend/src/components/AvailabilityModal.tsx": "Empty or missing content; no implementation provided.",
  "frontend/src/components/BookingSteps.tsx": "Renders a three‑step animated booking guide with icons and styling based on listing category.",
  "frontend/src/components/CategoryGrid.tsx": "Empty or missing content; no implementation provided.",
  "frontend/src/components/ExploreSection.tsx": "Empty or missing content; no implementation provided.",
  "frontend/src/components/FeaturedListings.tsx": "Fetches featured listings and renders ListingCard components with variant cycling and loading skeletons.",
  "frontend/src/components/Footer.tsx": "Displays a multi‑column footer with branding, links, contact info, and social icons.",
  "frontend/src/components/Header.tsx": "Fixed top navigation bar handling login/logout, navigation, and role‑aware options like admin and property pages.",
  "frontend/src/components/HeroSection.tsx": "Empty or missing content; no implementation provided.",
  "frontend/src/components/IndiaMapSection.tsx": "Renders an interactive India map with animated city markers showing active and coming‑soon locations.",
  "frontend/src/components/Layout.tsx": "Wraps the app with Header, Footer, routed content, and conditionally shows the profile setup modal.",
  "frontend/src/components/ListingCard.tsx": "Renders a styled listing card with rating, availability, category icons, and navigation to details.",
  "frontend/src/components/ListingCard3D.tsx": "Displays a 3D‑animated listing card with hover effects, rating, availability, and category icons.",
  "frontend/src/components/ListingDetailModal.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/MapSection.tsx": "Shows an animated map section with marker pins, floating badges, and event marker tooltips.",
  "frontend/src/components/ProfileSetupModal.tsx": "Provides a modal form for users to create or update their profile and saves data via a mutation.",
  "frontend/src/components/PropertyStatusBadge.tsx": "Displays a badge showing property availability status with corresponding icon and styling.",
  "frontend/src/components/ReviewSection.tsx": "Handles listing reviews, allowing users to submit ratings and comments and displaying existing reviews.",
  "frontend/src/components/StarRating.tsx": "Renders interactive or static star-based rating UI with configurable size and max rating.",
  "frontend/src/components/TestimonialBubbles.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks that wrap backend actor calls for profiles, listings, events, reviews, and related data operations.",
  "frontend/src/index.css": "Tailwind-based global styles defining OKLCH theme variables, animations, and font settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUsPage.tsx": "Static About Us page displaying company info, registration details, and leadership profiles with styled UI sections.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page fetching admin data, managing submissions, notifications, charges, and quick publish actions.",
  "frontend/src/pages/BookingPolicyPage.tsx": "Displays booking policies and terms with sections for disclaimers, disputes, payments, cancellations, and guidelines inside a styled scrollable layout.",
  "frontend/src/pages/CategoryWorldPage.tsx": "Shows a grid of accommodation categories with images and animations, allowing users to navigate to filtered listings.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with animated category cards, stay types, lazy‑loaded map and availability components, and navigation to listings.",
  "frontend/src/pages/ListingPage.tsx": "Provides a listings browser with category filtering, lazy‑loaded cards and map, and dynamic data loading based on selected category.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays privacy policy content outlining data handling, user privacy commitments, and information practices in a scrollable UI.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page allowing viewing and editing of personal info, with save and logout actions tied to Internet Identity.",
  "frontend/src/pages/PropertyManagementPage.tsx": "Management interface for owners to create, edit, and update their property listings with dialogs and form handling.",
  "frontend/src/pages/PublicPropertySubmissionPage.tsx": "Public form for submitting new property listings with validation, image upload, and backend submission.",
  "frontend/src/pages/RefundPolicyPage.tsx": "Static page displaying the refund policy details with styled sections and scrollable content.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Static terms and conditions page outlining platform disclaimers and usage rules in a styled layout.",
  "frontend/src/pages/UnlockPage.tsx": "React page that loads a listing, handles login check, and lets users unlock and view contact details with actions like download, call, and WhatsApp.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with sessionStorage fallback and hash support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, shadows, animations, and plugin setup.",
  "project_state.json": "Project state file describing current scope, architectural notes, known issues, and existing feature definitions."
}