{
  "backend/main.mo": "Defines core backend actor with user profiles, listings, bookings, and access control, integrating storage, Stripe, and authorization mixins.",
  "feature_evidence.json": "Contains feature evidence metadata describing implemented features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists short summaries of multiple frontend components, pages, and configs for reference or documentation.",
  "frontend/index.css": "Defines Tailwind CSS base variables for light and dark themes with color tokens and global styles.",
  "frontend/index.html": "HTML entry point with SEO metadata, Open Graph tags, and updated Tech Neon branding assets.",
  "frontend/src/App.tsx": "Sets up the main React app with TanStack Router routes, theme provider, and React Query client.",
  "frontend/src/components/AvailabilityCounter.tsx": "Displays live availability counts for different property types with loading skeletons and animated counters.",
  "frontend/src/components/AvailabilityModal.tsx": "Empty or missing file content.",
  "frontend/src/components/BookingSteps.tsx": "Shows a three-step booking flow with animated cards tailored to the selected listing category.",
  "frontend/src/components/CategoryGrid.tsx": "Empty or missing file content.",
  "frontend/src/components/ExploreSection.tsx": "Empty or missing file content.",
  "frontend/src/components/FeaturedListings.tsx": "Fetches and displays featured property listings with skeletons and rotating visual variants.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, legal links, and social/contact info.",
  "frontend/src/components/Header.tsx": "Provides the main site header with navigation, authentication actions, and admin/user options.",
  "frontend/src/components/HeroSection.tsx": "Empty or missing file content.",
  "frontend/src/components/IndiaMapSection.tsx": "Shows an India map with animated city markers indicating active and coming-soon locations.",
  "frontend/src/components/Layout.tsx": "Wraps the app layout with header, footer, routed content, and optional profile-setup modal.",
  "frontend/src/components/ListingCard.tsx": "Displays a property card with availability, rating, category icons, and style variants, allowing navigation to detailed view.",
  "frontend/src/components/ListingCard3D.tsx": "Renders a 3D‑styled property card with hover animations, rating info, and availability indicators.",
  "frontend/src/components/ListingDetailModal.tsx": "Empty file or placeholder for a listing detail modal component.",
  "frontend/src/components/MapSection.tsx": "Shows an animated map section with event markers, floating badges, and styled map pins.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with form fields, validation, and profile save mutation.",
  "frontend/src/components/PropertyStatusBadge.tsx": "Displays a status badge for a property with icons and styling based on its status value.",
  "frontend/src/components/ReviewSection.tsx": "Handles listing reviews, including display, adding new reviews, and rating selection.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating component supporting interactive rating and size variations.",
  "frontend/src/components/TestimonialBubbles.tsx": "Empty file or placeholder for a testimonial bubbles component.",
  "frontend/src/components/TrustBadge.tsx": "A memoized badge component that renders styled SVG gradients and optional icons based on variant and size.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of data-fetching and mutation hooks using React Query to interact with backend listings, profiles, reviews, and related entities.",
  "frontend/src/index.css": "Global Tailwind CSS setup with custom OKLCH color variables, typography, and animation definitions.",
  "frontend/src/main.tsx": "App entry point that initializes React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/pages/AboutUsPage.tsx": "A styled About Us page displaying company info, registration details, and leadership profiles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that loads admin-only data, handles quick-publish actions, notification management, free‑trial toggles, and city charge updates.",
  "frontend/src/pages/BookingPolicyPage.tsx": "Static booking policy page displaying platform disclaimers, dispute terms, and related informational sections.",
  "frontend/src/pages/CategoryWorldPage.tsx": "Category browsing page listing accommodation types with images and navigating users to filtered listings.",
  "frontend/src/pages/HomePage.tsx": "Home page showcasing category cards, stay types, and interactive sections with lazy-loaded map and availability components.",
  "frontend/src/pages/ListingPage.tsx": "Listings page that filters listings by category, loads them via API hooks, and displays results with lazy-loaded map and cards.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a styled privacy policy page with sections describing data use, collection, and user privacy commitments.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the logged‑in user's profile with identity checks, form fields, save logic, and logout handling.",
  "frontend/src/pages/PropertyManagementPage.tsx": "Allows authenticated owners to create, edit, and manage property listings with form dialogs and backend mutations.",
  "frontend/src/pages/PublicPropertySubmissionPage.tsx": "Provides a public form for submitting property listings with validation, image upload handling, and submission to backend.",
  "frontend/src/pages/RefundPolicyPage.tsx": "Shows a styled refund policy page explaining conditions for refund eligibility for the unlock fee.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Renders a styled Terms & Conditions page with sections for platform disclaimers and other legal content using scrollable layout and themed UI components.",
  "frontend/src/pages/UnlockPage.tsx": "Displays listing details with gated contact info, handling unlock requests, downloads, calling, and WhatsApp actions while enforcing user login.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL parameters, supporting both query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom colors, shadows, animations, and container settings with plugin integration.",
  "project_state.json": "Tracks project state, requirements, logo asset needs, and architectural notes for branding and badge components."
}