{
  "backend/main.mo": "Defines the main actor with authorization, storage, Stripe mixins, and data models for users, listings, bookings, and related domain types.",
  "backend/migration.mo": "Provides a migration function converting old listing records to a new format by adding a default propertyStatus field across stored maps.",
  "feature_evidence.json": "Lists feature evidence entries describing frontend updates, affected files, components, and associated test requirements.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for various frontend files describing UI components, pages, hooks, and styling.",
  "frontend/index.css": "Defines Tailwind base styles, theme variables, and dark‑mode color tokens for global styling.",
  "frontend/index.html": "HTML entry point setting metadata, SEO tags, favicon, and loading the main frontend script.",
  "frontend/src/App.tsx": "Sets up routing, theming, and React Query, registering all application routes and rendering the root layout.",
  "frontend/src/components/AvailabilityCounter.tsx": "Displays live availability counts for various property types with loading skeletons and animated cards.",
  "frontend/src/components/AvailabilityModal.tsx": "Empty or missing component file.",
  "frontend/src/components/BookingSteps.tsx": "Renders a three-step booking guide with icons and animations based on property category.",
  "frontend/src/components/CategoryGrid.tsx": "Empty or missing component file.",
  "frontend/src/components/ExploreSection.tsx": "Empty or missing component file.",
  "frontend/src/components/FeaturedListings.tsx": "Fetches featured listings and displays them using ListingCard components with loading skeletons and style variants.",
  "frontend/src/components/Footer.tsx": "Provides a styled footer with brand info, navigation links, social icons, and copyright.",
  "frontend/src/components/Header.tsx": "Implements a responsive header with navigation, authentication controls, and admin/user options.",
  "frontend/src/components/HeroSection.tsx": "Empty or missing component file.",
  "frontend/src/components/IndiaMapSection.tsx": "Displays an interactive India map with animated city markers indicating active and coming-soon locations.",
  "frontend/src/components/Layout.tsx": "Wraps the app with Header, Footer, routed content, and conditionally shows a profile setup modal.",
  "frontend/src/components/ListingCard.tsx": "Interactive listing card showing images, availability, category icon, and rating with multiple visual style variants.",
  "frontend/src/components/ListingCard3D.tsx": "3D‑styled listing card with hover animations, basic availability/status helpers, and image display.",
  "frontend/src/components/ListingDetailModal.tsx": "Empty component file.",
  "frontend/src/components/MapSection.tsx": "Animated map-like section displaying event markers, bouncing pins, and floating info badges.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form to collect and save user profile details with validation and toast notifications.",
  "frontend/src/components/PropertyStatusBadge.tsx": "Badge component mapping property status values to labels, icons, and color styles.",
  "frontend/src/components/ReviewSection.tsx": "Review display and submission UI with rating input, comment form, and review list.",
  "frontend/src/components/StarRating.tsx": "Star rating component supporting filled/partial states and optional interactive selection.",
  "frontend/src/components/TestimonialBubbles.tsx": "Empty component file.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and login flow using AuthClient, exposing identity state and helper methods.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks that call various backend actor methods to fetch and mutate user profiles, listings, events, reviews, and admin data.",
  "frontend/src/index.css": "Global Tailwind-based CSS defining color variables, typography, animations, and base styling for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the main App component.",
  "frontend/src/pages/AboutUsPage.tsx": "Renders a styled About Us page describing the STYO platform, company registration details, and leadership information.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard UI, loading admin-only data, managing owners, city charges, notifications, and quick-publish actions.",
  "frontend/src/pages/BookingPolicyPage.tsx": "Renders a styled booking policy page with scrollable sections explaining STYO’s terms and responsibilities.",
  "frontend/src/pages/CategoryWorldPage.tsx": "Displays a grid of accommodation categories and navigates to filtered listings when a category is selected.",
  "frontend/src/pages/HomePage.tsx": "Homepage with lazy‑loaded sections, animated category cards, and navigation to listings based on selected categories.",
  "frontend/src/pages/ListingPage.tsx": "Shows listings with category filtering, loading states, and lazy‑loaded 3D cards and map components.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page supporting viewing, editing, and saving profile data plus logout handling.",
  "frontend/src/pages/PropertyManagementPage.tsx": "Provides UI and logic for authenticated users to create, edit, and list their property listings using backend query hooks.",
  "frontend/src/pages/PublicPropertySubmissionPage.tsx": "Implements a public form for submitting new property listings with image uploads, validation, and backend submission.",
  "frontend/src/pages/UnlockPage.tsx": "Displays a property’s details and handles unlocking owner contact information, including rating display and contact actions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, sizes, plugins, and extended utilities for the frontend.",
  "project_state.json": "Defines current project state and requirements for adding a new PropertyStatus enum, updating backend Listing model, and updating frontend to display status badges. Includes existing features, pending requests, and architectural notes for implementing the new 4‑status model."
}