{
  "kind": "build_request",
  "title": "Increase navbar logo size and alignment in header",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the navbar logo rendering in `frontend/src/components/Header.tsx` so the logo appears larger in the header: set the logo image height to be within 36–40px on mobile and 48–56px on desktop, while preserving aspect ratio (no stretching).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Increase the logo height in the navbar.\nDesktop: 48–56px height\nMobile: 36–40px height\nEnsure aspect ratio is preserved (no stretching)."
        ]
      },
      "acceptanceCriteria": [
        "On viewport widths below the `sm` breakpoint, the rendered logo height is between 36px and 40px.",
        "On desktop viewports, the rendered logo height is between 48px and 56px.",
        "The logo uses `width: auto` (or equivalent) so the SVG is not stretched/squashed."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the navbar logo is not visually reduced by extra padding or a constrained parent container: the logo’s displayed height must match the intended CSS height (not shrunk due to padding, line-height, or container constraints), and the logo remains vertically aligned with the Login/Logout button in the header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Do not shrink it inside extra padding.\nMaintain proper vertical alignment with the Login button."
        ]
      },
      "acceptanceCriteria": [
        "The logo and the Login/Logout button are vertically centered relative to each other in the header (no noticeable baseline mismatch).",
        "There is no additional padding/margin applied to the logo element that reduces its visible size relative to the specified height."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Use only the clean SVG logo asset for the header logo (no raster/PNG logo usage in the navbar), keeping the existing SVG path as the source of truth.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use the clean SVG version only"
        ]
      },
      "acceptanceCriteria": [
        "The header logo `<img>` source points to an SVG asset (not PNG/JPG).",
        "No alternative raster logo source is used for the navbar logo across breakpoints."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/hooks/` listed as immutable in SYSTEM_CONTEXT.",
    "Keep all changes within the existing React + Tailwind setup; do not introduce new frontend frameworks or backend services."
  ],
  "nonGoals": [
    "Generating or redesigning the logo artwork.",
    "Changing favicon, footer logo, or other branding placements not directly related to the header logo size/alignment."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}