{
  "kind": "build_request",
  "title": "Implement STYO Tech Neon primary logo assets and modular SVG Verified badge system",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate and add the official STYO primary logo assets using the “Tech Neon” direction: clean modern scalable SVG with a blue-to-purple gradient, subtle depth (not heavy 3D), optimized for dark UI, high contrast, and lightweight for web performance. Deliver full logo (icon + “STYO” text), icon-only, and white monochrome versions, each provided as SVG and transparent PNG.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Primary Logo\nUse the Tech Neon version (blue–purple gradient 3D style) as the official STYO logo.\nClean, modern, scalable SVG\nBlue to purple gradient\nSubtle depth (not heavy 3D render)\nOptimized for dark UI\nHigh contrast\nLightweight for performance\nDeliver:\nFull logo (icon + STYO text)\nIcon only version (for favicon & app icon)\nWhite monochrome version\nTransparent PNG + SVG"
        ]
      },
      "acceptanceCriteria": [
        "New logo assets exist under frontend/public/assets/generated using the filenames specified in imageRequirements.",
        "Full logo includes both icon and the text “STYO” and remains legible on dark backgrounds.",
        "SVGs render correctly at small and large sizes without pixelation and without filter-heavy effects that bloat file size.",
        "PNG variants have transparent backgrounds."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the app to consistently use the new Tech Neon STYO logo assets in existing UI entry points: header brand image, footer brand image, and SEO/social metadata assets. Replace current references to /assets/generated/styo-logo-transparent.dim_200x80.png with the new full-logo asset, and update favicon usage to the new icon-only asset.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use the Tech Neon version (blue–purple gradient 3D style) as the official STYO logo.",
          "Icon only version (for favicon & app icon)"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/Header.tsx and frontend/src/components/Footer.tsx use the new full-logo asset path(s) under /assets/generated/ and no longer reference /assets/generated/styo-logo-transparent.dim_200x80.png.",
        "frontend/index.html favicon link uses the new icon-only asset (not the full logo).",
        "frontend/index.html og:image and twitter:image use an appropriate new logo image (PNG) under /assets/generated/.",
        "Logo remains crisp on mobile and desktop (no layout shift; responsive sizing preserved)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement a reusable SVG-based Gold “Verified” trust badge component (inspired by the gold D concept) with a clean gold gradient, subtle glow (not flashy), and web-performance-friendly SVG markup. The component must be reusable and accept props to support future badge variants (Featured with purple glow tag, Premium with gold outline, Elite with diamond style) without requiring a rewrite.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Trust Badge System\nCreate a reusable Gold “Verified” badge component (inspired by the gold D concept).\nRequirements:\nSVG-based (not raster image)\nReusable component\nDynamically attachable to listings\nClean gold gradient (premium feel)\nSubtle glow, not flashy\nFuture Scalability\nKeep the badge system modular so we can later add:\nFeatured (purple glow tag)\nPremium (gold outline)\nElite (diamond style)\nEverything must be optimized for web performance and mobile responsiveness."
        ]
      },
      "acceptanceCriteria": [
        "A new reusable React component exists (e.g., in frontend/src/components/) that renders the Verified badge as inline SVG (no raster images).",
        "The component supports common customization via props (at minimum: size and className; plus a variant/type pattern suitable for adding Featured/Premium/Elite later).",
        "SVG uses a gold gradient and subtle glow effect while remaining lightweight (avoid large embedded bitmaps or excessively complex filters).",
        "Component is responsive (renders cleanly at small sizes such as within a listing card)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Attach the new Gold “Verified” badge component to listings in the UI in a way that is dynamically driven by listing data. Specifically, replace the current “Verified” pill/badge rendering in listing cards with the new SVG badge when listing.verified is true, while keeping layout mobile-responsive and not regressing performance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Dynamically attachable to listings",
          "This will be used for: Verified Listings"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/components/ListingCard.tsx, when listing.verified is true, the UI displays the new SVG Gold Verified badge instead of (or in place of) the existing green “Verified” pill at the top-left of the image area.",
        "The listing card remains visually balanced on small screens (badge does not overflow or cover critical content).",
        "No backend changes are required to render the badge; it uses existing listing.verified data."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Keep all changes compatible with the existing React + TypeScript + Tailwind + React Query stack.",
    "Do not introduce raster images for the trust badge; it must be SVG-based."
  ],
  "nonGoals": [
    "Do not implement third-party brand services, CDN hosting, or external asset pipelines.",
    "Do not add new backend fields or workflows for premium/elite/featured badges beyond preparing the frontend component API for future variants.",
    "Do not redesign unrelated parts of the UI outside swapping logo usage points and adding the verified badge component."
  ],
  "imageRequirements": {
    "required": [
      "STYO full logo (icon + STYO text), tech neon blue-to-purple gradient with subtle depth, dark-background optimized (styo-logo-tech-neon-full.dim_1200x400.svg)",
      "STYO full logo (icon + STYO text), tech neon blue-to-purple gradient with subtle depth, transparent background (styo-logo-tech-neon-full.dim_1200x400.png)",
      "STYO icon-only logo mark, tech neon blue-to-purple gradient with subtle depth, transparent background (styo-logo-tech-neon-icon.dim_512x512.svg)",
      "STYO icon-only logo mark, tech neon blue-to-purple gradient with subtle depth, transparent background (styo-logo-tech-neon-icon.dim_512x512.png)",
      "STYO full logo (icon + STYO text) white monochrome, transparent background (styo-logo-white-full.dim_1200x400.svg)",
      "STYO full logo (icon + STYO text) white monochrome, transparent background (styo-logo-white-full.dim_1200x400.png)",
      "STYO icon-only logo mark white monochrome, transparent background (styo-logo-white-icon.dim_512x512.svg)",
      "STYO icon-only logo mark white monochrome, transparent background (styo-logo-white-icon.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}