{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "PropertyStatus badges in listing card + unlock detail page (frontend-only)",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Update frontend-consumed backend types so Listing includes strongly-typed propertyStatus.",
      "acceptanceCriteria": [
        "Frontend compiles successfully with the updated candid/types such that `Listing.propertyStatus` is available and strongly typed.",
        "No TypeScript `any` workarounds are introduced to access `propertyStatus`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the generated/consumed backend type declarations to match the backend candid changes so `Listing` includes `propertyStatus: PropertyStatus` and `PropertyStatus` includes the 4 variants. Ensure downstream imports compile without TypeScript workarounds."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Render a dynamic propertyStatus badge on ListingCard with required English labels and safe fallback.",
      "acceptanceCriteria": [
        "`ListingCard` renders a status badge based on `listing.propertyStatus` for all 4 statuses.",
        "Badge text uses English labels exactly corresponding to the 4 statuses.",
        "If a listing is missing `propertyStatus` at runtime for any reason, the UI falls back to displaying \"Available\" rather than crashing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PropertyStatusBadge.tsx",
          "operation": "create",
          "description": "Create a reusable `PropertyStatusBadge` component that maps `PropertyStatus` values to the exact labels: \"Available\", \"Visit Completed\", \"Under Confirmation\", \"Booked via STYO\" and accepts an optional/undefined status with a safe fallback to \"Available\". Use the shadcn-ui `Badge` component to present the status consistently. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ListingCard.tsx",
          "operation": "modify",
          "description": "Add the new property status badge to the property card UI using `PropertyStatusBadge`, driven by `listing.propertyStatus` with a defensive runtime fallback (do not change existing availability UI/behavior). Wire the badge into the card layout so it is visible alongside existing badges. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Render a dynamic propertyStatus badge on UnlockPage with the same labels and visibility whenever listing data is shown.",
      "acceptanceCriteria": [
        "`UnlockPage` displays a property status badge based on `listing.propertyStatus` for all 4 statuses.",
        "Badge stays consistent with the property card labels (Available, Visit Completed, Under Confirmation, Booked via STYO).",
        "Page renders without errors before and after unlock (badge is visible whenever listing data is visible)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UnlockPage.tsx",
          "operation": "modify",
          "description": "Display the `PropertyStatusBadge` on the property detail page (route `/unlock/$listingId`) whenever listing data is rendered, using the same label mapping and safe fallback behavior as the listing card. Ensure it remains visible both before and after unlocking contact details. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Ensure this change only adds the 4-status model display in UI, without adding confirmation/auto-transition workflows.",
      "acceptanceCriteria": [
        "No new backend methods, timers, or workflows are added to automatically change `propertyStatus` based on actions.",
        "No owner/customer confirmation UI flows are added as part of this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PropertyStatusBadge.tsx",
          "operation": "modify",
          "description": "Keep the status handling strictly presentational: mapping and styling only. Do not introduce any UI actions, mutations, or flows that change `propertyStatus`."
        },
        {
          "path": "frontend/src/components/ListingCard.tsx",
          "operation": "modify",
          "description": "Confirm the ListingCard change is display-only (no new calls/mutations or status-transition logic). The existing availability behavior must remain unchanged."
        },
        {
          "path": "frontend/src/pages/UnlockPage.tsx",
          "operation": "modify",
          "description": "Confirm the UnlockPage change is display-only and does not add any confirmation UX or automatic propertyStatus updates; only show the badge when listing data is available."
        }
      ]
    }
  ]
}