{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Increase header navbar logo size and align with auth button",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Increase header logo height responsively while preserving SVG aspect ratio.",
      "acceptanceCriteria": [
        "On viewport widths below the `sm` breakpoint, the rendered logo height is between 36px and 40px.",
        "On desktop viewports, the rendered logo height is between 48px and 56px.",
        "The logo uses `width: auto` (or equivalent) so the SVG is not stretched/squashed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Adjust the logo <img> Tailwind sizing classes to meet the required responsive heights (36–40px below `sm`, 48–56px on desktop) while preserving aspect ratio via `w-auto` (and/or `aspect-auto`). Ensure the logo uses explicit height utilities (e.g., `h-9`/`h-10` and `sm:h-12`/`sm:h-14`) rather than relying on inherited line-height."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Prevent container/padding constraints from shrinking the logo and keep it vertically aligned with the Login/Logout button.",
      "acceptanceCriteria": [
        "The logo and the Login/Logout button are vertically centered relative to each other in the header (no noticeable baseline mismatch).",
        "There is no additional padding/margin applied to the logo element that reduces its visible size relative to the specified height."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update the logo wrapper and image classes to avoid any default button padding/line-height effects (e.g., add `p-0`, `leading-none`, `shrink-0`, and make the <img> `block`) and ensure the header row maintains `items-center` alignment between the left logo cluster and the right auth button cluster so the visual centers match."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the header navbar logo uses only the SVG asset across all breakpoints.",
      "acceptanceCriteria": [
        "The header logo `<img>` source points to an SVG asset (not PNG/JPG).",
        "No alternative raster logo source is used for the navbar logo across breakpoints."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Confirm the header logo continues to reference the existing SVG asset as the single source of truth (keep the <img src> pointing to the SVG), and avoid adding any conditional rendering or breakpoints that swap in raster images."
        }
      ]
    }
  ]
}